nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_INPUTMUX_CONNECTIONS_
#define _FSL_INPUTMUX_CONNECTIONS_

#include "fsl_device_registers.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.inputmux_connections"
#endif

/*!
 * @addtogroup inputmux_driver
 * @{
 */

/*! @brief Periphinmux IDs */
#define PINTSEL_PMUX_ID 0x100U
#define DSP_INT_PMUX_ID 0x140U

#if defined(INPUTMUX0)
#define SCT0_PMUX_ID             0x00U
#define FLEXCOMM0_ITRIG_PMUX_ID  0x200U
#define FLEXCOMM1_ITRIG_PMUX_ID  0x220U
#define FLEXCOMM2_ITRIG_PMUX_ID  0x240U
#define FLEXCOMM3_ITRIG_PMUX_ID  0x260U
#define FLEXCOMM4_ITRIG_PMUX_ID  0x280U
#define FLEXCOMM5_ITRIG_PMUX_ID  0x2A0U
#define FLEXCOMM6_ITRIG_PMUX_ID  0x2C0U
#define FLEXCOMM7_ITRIG_PMUX_ID  0x2E0U
#define FLEXCOMM8_ITRIG_PMUX_ID  0x300U
#define FLEXCOMM9_ITRIG_PMUX_ID  0x320U
#define FLEXCOMM10_ITRIG_PMUX_ID 0x340U
#define FLEXCOMM11_ITRIG_PMUX_ID 0x360U
#define FLEXCOMM12_ITRIG_PMUX_ID 0x380U
#define FLEXCOMM13_ITRIG_PMUX_ID 0x3A0U
#define CT32BIT0_CAP_PMUX_ID     0x600U
#define CT32BIT1_CAP_PMUX_ID     0x620U
#define CT32BIT2_CAP_PMUX_ID     0x640U
#define CT32BIT3_CAP_PMUX_ID     0x660U
#define CT32BIT4_CAP_PMUX_ID     0x680U
#define CT32BIT0_TRIG_PMUX_ID    0x610U
#define CT32BIT1_TRIG_PMUX_ID    0x630U
#define CT32BIT2_TRIG_PMUX_ID    0x650U
#define CT32BIT3_TRIG_PMUX_ID    0x670U
#define CT32BIT4_TRIG_PMUX_ID    0x690U
#define FREQME_REF_PMUX_ID       0x700U
#define FREQME_TAR_PMUX_ID       0x704U
#define EZHV_PMUX_ID             0x720U
#define FLEXIO_PMUX_ID           0x760U
#elif defined(INPUTMUX1)
#define FLEXCOMM17_ITRIG_PMUX_ID 0x200U
#define FLEXCOMM18_ITRIG_PMUX_ID 0x220U
#define FLEXCOMM19_ITRIG_PMUX_ID 0x240U
#define FLEXCOMM20_ITRIG_PMUX_ID 0x260U
#define ADC0_TRIG_PMUX_ID        0x400U
#define CT32BIT5_CAP_PMUX_ID     0x600U
#define CT32BIT6_CAP_PMUX_ID     0x620U
#define CT32BIT7_CAP_PMUX_ID     0x640U
#define CT32BIT5_TRIG_PMUX_ID    0x610U
#define CT32BIT6_TRIG_PMUX_ID    0x630U
#define CT32BIT7_TRIG_PMUX_ID    0x650U

#else
#error "Unsupported core!"
#endif

#define PMUX_SHIFT 20U

/*! @brief INPUTMUX connections type */
typedef enum _inputmux_connection_t
{
#if defined(INPUTMUX0)
    /*!< SCT INMUX. */
    kINPUTMUX_Sct0PinInp0ToSct0   = 0U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp1ToSct0   = 1U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp2ToSct0   = 2U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp3ToSct0   = 3U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp4ToSct0   = 4U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp5ToSct0   = 5U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp6ToSct0   = 6U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0PinInp7ToSct0   = 7U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer0Mat0ToSct0   = 8U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer1Mat0ToSct0   = 9U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer2Mat0ToSct0   = 10U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer3Mat0ToSct0   = 11U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer4Mat0ToSct0   = 12U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToSct0       = 13U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioIntBmatchToSct0 = 14U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToSct0       = 15U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToSct0       = 16U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxBclkToSct0    = 17U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxBclkToSct0    = 18U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxBclkToSct0    = 19U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxBclkToSct0    = 20U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxBclkToSct0    = 21U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxBclkToSct0    = 22U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_MclkToSct0          = 23U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cpu0TxevToSct0      = 24U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_DebugHaltedToSct0   = 25U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToSct0    = 26U + (SCT0_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToSct0    = 27U + (SCT0_PMUX_ID << PMUX_SHIFT),

    /*!< Pin Interrupt. */
    kINPUTMUX_GpioPort0Pin0ToPintsel  = 0U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin1ToPintsel  = 1U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin2ToPintsel  = 2U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin3ToPintsel  = 3U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin4ToPintsel  = 4U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin5ToPintsel  = 5U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin6ToPintsel  = 6U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin7ToPintsel  = 7U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin8ToPintsel  = 8U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin9ToPintsel  = 9U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin10ToPintsel = 10U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin11ToPintsel = 11U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin12ToPintsel = 12U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin13ToPintsel = 13U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin14ToPintsel = 14U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin15ToPintsel = 15U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin16ToPintsel = 16U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin17ToPintsel = 17U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin18ToPintsel = 18U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin19ToPintsel = 19U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin20ToPintsel = 20U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin21ToPintsel = 21U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin22ToPintsel = 22U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin23ToPintsel = 23U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin24ToPintsel = 24U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin25ToPintsel = 25U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin26ToPintsel = 26U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin27ToPintsel = 27U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin28ToPintsel = 28U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin29ToPintsel = 29U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin30ToPintsel = 30U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort0Pin31ToPintsel = 31U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin0ToPintsel  = 32U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin1ToPintsel  = 33U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin2ToPintsel  = 34U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin3ToPintsel  = 35U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin4ToPintsel  = 36U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin5ToPintsel  = 37U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin6ToPintsel  = 38U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin7ToPintsel  = 39U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin8ToPintsel  = 40U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin9ToPintsel  = 41U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin10ToPintsel = 42U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin11ToPintsel = 43U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin12ToPintsel = 44U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin13ToPintsel = 45U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin14ToPintsel = 46U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin15ToPintsel = 47U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin16ToPintsel = 48U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin17ToPintsel = 49U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin18ToPintsel = 50U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort1Pin19ToPintsel = 51U + (PINTSEL_PMUX_ID << PMUX_SHIFT),

    /*!< DSP Interrupt. */
    kINPUTMUX_Flexcomm0ToDspInterrupt    = 0U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm1ToDspInterrupt    = 1U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm2ToDspInterrupt    = 2U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm3ToDspInterrupt    = 3U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm4ToDspInterrupt    = 4U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm5ToDspInterrupt    = 5U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm6ToDspInterrupt    = 6U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm7ToDspInterrupt    = 7U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm8ToDspInterrupt    = 8U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm9ToDspInterrupt    = 9U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm10ToDspInterrupt   = 10U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm11ToDspInterrupt   = 11U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm12ToDspInterrupt   = 12U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm13ToDspInterrupt   = 13U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mu2AToDspInterrupt         = 14U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mu4BToDspInterrupt         = 15U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt0ToDspInterrupt         = 16U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt1ToDspInterrupt         = 17U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Utick0ToDspInterrupt       = 18U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Spi14ToDspInterrupt        = 19U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mrt0ToDspInterrupt         = 20U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_OsEventTimerToDspInterrupt = 21U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer0ToDspInterrupt      = 22U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer1ToDspInterrupt      = 23U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer2ToDspInterrupt      = 24U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer3ToDspInterrupt      = 25U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer4ToDspInterrupt      = 26U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0AlarmToDspInterrupt    = 27U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0WakeupToDspInterrupt   = 28U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c0ToDspInterrupt         = 29U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c1ToDspInterrupt         = 30U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_MicfilToDspInterrupt       = 31U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_HwvadToDspInterrupt        = 32U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_LcdifToDspInterrupt        = 33U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpuToDspInterrupt          = 34U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_EzhvToDspInterrupt         = 35U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FlexioToDspInterrupt       = 36U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Spi16ToDspInterrupt        = 37U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq0ToDspInterrupt     = 38U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq1ToDspInterrupt     = 39U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq2ToDspInterrupt     = 40U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq3ToDspInterrupt     = 41U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq4ToDspInterrupt     = 42U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq5ToDspInterrupt     = 43U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq6ToDspInterrupt     = 44U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq7ToDspInterrupt     = 45U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq8ToDspInterrupt     = 46U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq9ToDspInterrupt     = 47U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq10ToDspInterrupt    = 48U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq11ToDspInterrupt    = 49U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq12ToDspInterrupt    = 50U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq13ToDspInterrupt    = 51U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq14ToDspInterrupt    = 52U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Irq15ToDspInterrupt    = 53U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq0ToDspInterrupt     = 54U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq1ToDspInterrupt     = 55U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq2ToDspInterrupt     = 56U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq3ToDspInterrupt     = 57U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq4ToDspInterrupt     = 58U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq5ToDspInterrupt     = 59U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq6ToDspInterrupt     = 60U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq7ToDspInterrupt     = 61U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq8ToDspInterrupt     = 62U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq9ToDspInterrupt     = 63U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq10ToDspInterrupt    = 64U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq11ToDspInterrupt    = 65U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq12ToDspInterrupt    = 66U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq13ToDspInterrupt    = 67U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq14ToDspInterrupt    = 68U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Irq15ToDspInterrupt    = 69U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio0Irq0ToDspInterrupt    = 70U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio0Irq1ToDspInterrupt    = 71U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1Irq0ToDspInterrupt    = 72U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1Irq1ToDspInterrupt    = 73U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2Irq0ToDspInterrupt    = 74U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2Irq1ToDspInterrupt    = 75U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3Irq0ToDspInterrupt    = 76U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3Irq1ToDspInterrupt    = 77U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4Irq0ToDspInterrupt    = 78U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4Irq1ToDspInterrupt    = 79U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5Irq0ToDspInterrupt    = 80U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5Irq1ToDspInterrupt    = 81U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6Irq0ToDspInterrupt    = 82U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6Irq1ToDspInterrupt    = 83U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7Irq0ToDspInterrupt    = 84U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7Irq1ToDspInterrupt    = 85U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0ToDspInterrupt     = 86U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1ToDspInterrupt     = 87U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt2ToDspInterrupt     = 88U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt3ToDspInterrupt     = 89U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt4ToDspInterrupt     = 90U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt5ToDspInterrupt     = 91U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt6ToDspInterrupt     = 92U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt7ToDspInterrupt     = 93U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0ToDspInterrupt         = 94U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1ToDspInterrupt         = 95U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2ToDspInterrupt         = 96U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3ToDspInterrupt         = 97U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Xspi0ToDspInterrupt        = 98U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Xspi1ToDspInterrupt        = 99U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Xspi2ToDspInterrupt        = 100U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_JpegIrqToDspInterrupt      = 101U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_PngIrqToDspInterrupt       = 102U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Neutron64IrqToDspInterrupt = 103U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_PmcIrqToDspInterrupt       = 104U + (DSP_INT_PMUX_ID << PMUX_SHIFT),

