nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
    /* FLEXCOMM0 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm0         = 0U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm0         = 1U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm0         = 2U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm0         = 3U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm0       = 4U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm0       = 5U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm0       = 6U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm0        = 7U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm0        = 8U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm0        = 9U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm0        = 10U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm0        = 11U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm0 = 12U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm0        = 13U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm0        = 14U + (FLEXCOMM0_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM1 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm1         = 0U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm1         = 1U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm1         = 2U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm1         = 3U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm1       = 4U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm1       = 5U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm1       = 6U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm1        = 7U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm1        = 8U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm1        = 9U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm1        = 10U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm1        = 11U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm1 = 12U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm1        = 13U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm1        = 14U + (FLEXCOMM1_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM2 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm2         = 0U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm2         = 1U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm2         = 2U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm2         = 3U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm2       = 4U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm2       = 5U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm2       = 6U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm2        = 7U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm2        = 8U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm2        = 9U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm2        = 10U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm2        = 11U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm2 = 12U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm2        = 13U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm2        = 14U + (FLEXCOMM2_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM3 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm3         = 0U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm3         = 1U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm3         = 2U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm3         = 3U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm3       = 4U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm3       = 5U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm3       = 6U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm3        = 7U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm3        = 8U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm3        = 9U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm3        = 10U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm3        = 11U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm3 = 12U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm3        = 13U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm3        = 14U + (FLEXCOMM3_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM4 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm4         = 0U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm4         = 1U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm4         = 2U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm4         = 3U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm4       = 4U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm4       = 5U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm4       = 6U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm4        = 7U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm4        = 8U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm4        = 9U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm4        = 10U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm4        = 11U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm4 = 12U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm4        = 13U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm4        = 14U + (FLEXCOMM4_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM5 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm5         = 0U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm5         = 1U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm5         = 2U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm5         = 3U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm5       = 4U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm5       = 5U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm5       = 6U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm5        = 7U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm5        = 8U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm5        = 9U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm5        = 10U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm5        = 11U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm5 = 12U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm5        = 13U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm5        = 14U + (FLEXCOMM5_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM6 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm6         = 0U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm6         = 1U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm6         = 2U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm6         = 3U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm6       = 4U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm6       = 5U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm6       = 6U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm6        = 7U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm6        = 8U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm6        = 9U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm6        = 10U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm6        = 11U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm6 = 12U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm6        = 13U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm6        = 14U + (FLEXCOMM6_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM7 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm7         = 0U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm7         = 1U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm7         = 2U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm7         = 3U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm7       = 4U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm7       = 5U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm7       = 6U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm7        = 7U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm7        = 8U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm7        = 9U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm7        = 10U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm7        = 11U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm7 = 12U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm7        = 13U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm7        = 14U + (FLEXCOMM7_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM8 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm8         = 0U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm8         = 1U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm8         = 2U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm8         = 3U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm8       = 4U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm8       = 5U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm8       = 6U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm8        = 7U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm8        = 8U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm8        = 9U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm8        = 10U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm8        = 11U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm8 = 12U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm8        = 13U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm8        = 14U + (FLEXCOMM8_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM9 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm9         = 0U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm9         = 1U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm9         = 2U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm9         = 3U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm9       = 4U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm9       = 5U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm9       = 6U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm9        = 7U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm9        = 8U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm9        = 9U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm9        = 10U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm9        = 11U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm9 = 12U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm9        = 13U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm9        = 14U + (FLEXCOMM9_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM10 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm10         = 0U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm10         = 1U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm10         = 2U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm10         = 3U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm10       = 4U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm10       = 5U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm10       = 6U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm10        = 7U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm10        = 8U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm10        = 9U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm10        = 10U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm10        = 11U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm10 = 12U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm10        = 13U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm10        = 14U + (FLEXCOMM10_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM11 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm11         = 0U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm11         = 1U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm11         = 2U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm11         = 3U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm11       = 4U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm11       = 5U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm11       = 6U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm11        = 7U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm11        = 8U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm11        = 9U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm11        = 10U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm11        = 11U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm11 = 12U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm11        = 13U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm11        = 14U + (FLEXCOMM11_ITRIG_PMUX_ID << PMUX_SHIFT),

