nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
    /*!< CTmier2 Input trigger mux. */
    kINPUTMUX_CtInp0ToTimer2Trigger     = 0U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer2Trigger     = 1U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer2Trigger     = 2U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer2Trigger     = 3U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer2Trigger     = 4U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer2Trigger     = 5U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer2Trigger     = 6U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer2Trigger     = 7U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer2Trigger     = 8U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer2Trigger     = 9U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer2Trigger    = 10U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer2Trigger    = 11U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer2Trigger    = 12U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer2Trigger    = 13U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer2Trigger    = 14U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer2Trigger    = 15U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer2Trigger = 16U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer2Trigger = 17U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer2Trigger = 18U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer2Trigger = 19U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer2Trigger = 20U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer2Trigger = 21U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer2Trigger    = 22U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer2Trigger    = 23U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer2Trigger    = 24U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer2Trigger = 25U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer2Trigger = 26U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer2Trigger   = 27U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer2Trigger   = 28U + (CT32BIT2_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier3 Input trigger mux. */
    kINPUTMUX_CtInp0ToTimer3Trigger     = 0U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer3Trigger     = 1U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer3Trigger     = 2U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer3Trigger     = 3U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer3Trigger     = 4U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer3Trigger     = 5U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer3Trigger     = 6U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer3Trigger     = 7U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer3Trigger     = 8U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer3Trigger     = 9U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer3Trigger    = 10U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer3Trigger    = 11U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer3Trigger    = 12U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer3Trigger    = 13U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer3Trigger    = 14U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer3Trigger    = 15U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer3Trigger = 16U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer3Trigger = 17U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer3Trigger = 18U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer3Trigger = 19U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer3Trigger = 20U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer3Trigger = 21U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer3Trigger    = 22U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer3Trigger    = 23U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer3Trigger    = 24U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer3Trigger = 25U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer3Trigger = 26U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer3Trigger   = 27U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer3Trigger   = 28U + (CT32BIT3_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier4 Input trigger mux. */
    kINPUTMUX_CtInp0ToTimer4Trigger     = 0U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer4Trigger     = 1U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer4Trigger     = 2U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer4Trigger     = 3U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer4Trigger     = 4U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer4Trigger     = 5U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer4Trigger     = 6U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer4Trigger     = 7U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer4Trigger     = 8U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer4Trigger     = 9U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer4Trigger    = 10U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer4Trigger    = 11U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer4Trigger    = 12U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer4Trigger    = 13U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer4Trigger    = 14U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer4Trigger    = 15U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer4Trigger = 16U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer4Trigger = 17U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer4Trigger = 18U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer4Trigger = 19U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer4Trigger = 20U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer4Trigger = 21U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer4Trigger    = 22U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer4Trigger    = 23U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer4Trigger    = 24U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer4Trigger = 25U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer4Trigger = 26U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer4Trigger   = 27U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer4Trigger   = 28U + (CT32BIT4_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< Frequency measurement reference clock. */
    kINPUTMUX_OscClkToFreqmeasRef         = 0U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro1Div8ToFreqmeasRef       = 1U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro1ToFreqmeasRef           = 2U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_LposcToFreqmeasRef          = 3U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_32KhzOscToFreqmeasRef       = 4U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro0ToFreqmeasRef           = 6U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro2ToFreqmeasRef           = 7U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FreqmeGpioAClkToFreqmeasRef = 8U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FreqmeGpioBClkToFreqmeasRef = 9U + (FREQME_REF_PMUX_ID << PMUX_SHIFT),

