nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
    /* FLEXIO0 input mux */
    kINPUTMUX_CtInp0ToFlexio0         = 0U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexio0         = 1U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexio0         = 2U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexio0         = 3U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexio0       = 4U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out7ToFlexio0       = 5U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out8ToFlexio0       = 6U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexio0        = 7U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexio0        = 8U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexio0        = 9U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexio0        = 10U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexio0        = 11U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BmatchToFlexio0 = 12U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexio0        = 13U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_EzhvOutToFlexio0        = 14U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqOutToFlexio0     = 15U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio0Irq0ToFlexio0      = 16U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio0Irq1ToFlexio0      = 17U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1Irq0ToFlexio0      = 18U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1Irq1ToFlexio0      = 19U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2Irq0ToFlexio0      = 20U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2Irq1ToFlexio0      = 21U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3Irq0ToFlexio0      = 22U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3Irq1ToFlexio0      = 23U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4Irq0ToFlexio0      = 24U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4Irq1ToFlexio0      = 25U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5Irq0ToFlexio0      = 26U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5Irq1ToFlexio0      = 27U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6Irq0ToFlexio0      = 28U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6Irq1ToFlexio0      = 29U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7Irq0ToFlexio0      = 30U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7Irq1ToFlexio0      = 31U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8Irq0ToFlexio0      = 32U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8Irq1ToFlexio0      = 33U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9Irq0ToFlexio0      = 34U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9Irq1ToFlexio0      = 35U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10Irq0ToFlexio0     = 36U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10Irq1ToFlexio0     = 37U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToFlexio0       = 38U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToFlexio0       = 39U + (FLEXIO_PMUX_ID << PMUX_SHIFT),
#else
    kINPUTMUX_GpioPort8Pin0ToPintsel   = 0U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin1ToPintsel   = 1U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin2ToPintsel   = 2U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin3ToPintsel   = 3U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin4ToPintsel   = 4U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin5ToPintsel   = 5U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin6ToPintsel   = 6U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin7ToPintsel   = 7U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin8ToPintsel   = 8U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin9ToPintsel   = 9U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin10ToPintsel  = 10U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin11ToPintsel  = 11U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin12ToPintsel  = 12U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin13ToPintsel  = 13U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin14ToPintsel  = 14U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin15ToPintsel  = 15U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin16ToPintsel  = 16U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin17ToPintsel  = 17U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin18ToPintsel  = 18U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin19ToPintsel  = 19U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin20ToPintsel  = 20U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin21ToPintsel  = 21U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin22ToPintsel  = 22U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin23ToPintsel  = 23U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin24ToPintsel  = 24U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin25ToPintsel  = 25U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin26ToPintsel  = 26U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin27ToPintsel  = 27U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin28ToPintsel  = 28U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin29ToPintsel  = 29U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin30ToPintsel  = 30U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort8Pin31ToPintsel  = 31U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin0ToPintsel  = 32U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin1ToPintsel  = 33U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin2ToPintsel  = 34U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin3ToPintsel  = 35U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin4ToPintsel  = 36U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin5ToPintsel  = 37U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin6ToPintsel  = 38U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin7ToPintsel  = 39U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin8ToPintsel  = 40U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin9ToPintsel  = 41U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin10ToPintsel = 42U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin11ToPintsel = 43U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin12ToPintsel = 44U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin13ToPintsel = 45U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin14ToPintsel = 46U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin15ToPintsel = 47U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin16ToPintsel = 48U + (PINTSEL_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioPort10Pin17ToPintsel = 49U + (PINTSEL_PMUX_ID << PMUX_SHIFT),

    /*!< DSP Interrupt. */
    kINPUTMUX_Flexcomm17ToDspInterrupt   = 0U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm18ToDspInterrupt   = 1U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm19ToDspInterrupt   = 2U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm20ToDspInterrupt   = 3U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Pmc1ToDspInterrupt         = 4U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8Irq0ToDspInterrupt    = 7U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8Irq1ToDspInterrupt    = 8U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9Irq0ToDspInterrupt    = 9U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9Irq1ToDspInterrupt    = 10U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10Irq0ToDspInterrupt   = 11U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10Irq1ToDspInterrupt   = 12U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt2ToDspInterrupt         = 13U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt3ToDspInterrupt         = 14U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mu0BToDspInterrupt         = 15U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mu3BToDspInterrupt         = 16U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Utick1ToDspInterrupt       = 17U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mrt1ToDspInterrupt         = 18U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_OsEventTimerToDspInterrupt = 19U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer5ToDspInterrupt      = 20U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer6ToDspInterrupt      = 21U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer7ToDspInterrupt      = 22U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc1AlarmToDspInterrupt    = 23U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc1WakeupToDspInterrupt   = 24U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c2ToDspInterrupt         = 25U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c3ToDspInterrupt         = 26U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_MicfilToDspInterrupt       = 27U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_HwvadToDspInterrupt        = 28U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq0ToDspInterrupt     = 34U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq1ToDspInterrupt     = 35U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq2ToDspInterrupt     = 36U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq3ToDspInterrupt     = 37U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq4ToDspInterrupt     = 38U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq5ToDspInterrupt     = 39U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq6ToDspInterrupt     = 40U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Irq7ToDspInterrupt     = 41U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq0ToDspInterrupt     = 42U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq1ToDspInterrupt     = 43U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq2ToDspInterrupt     = 44U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq3ToDspInterrupt     = 45U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq4ToDspInterrupt     = 46U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq5ToDspInterrupt     = 47U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq6ToDspInterrupt     = 48U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Irq7ToDspInterrupt     = 49U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0ToDspInterrupt     = 50U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1ToDspInterrupt     = 51U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt2ToDspInterrupt     = 52U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt3ToDspInterrupt     = 53U + (DSP_INT_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3ToDspInterrupt         = 54U + (DSP_INT_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM17 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm17         = 0U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm17         = 1U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm17         = 2U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm17         = 3U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct5Mat3ToFlexcomm17        = 7U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct6Mat3ToFlexcomm17        = 8U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct7Mat3ToFlexcomm17        = 9U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1BMatchToFlexcomm17 = 12U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm17        = 13U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm17        = 14U + (FLEXCOMM17_ITRIG_PMUX_ID << PMUX_SHIFT),

