nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
    /* FLEXCOMM18 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm18         = 0U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm18         = 1U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm18         = 2U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm18         = 3U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct5Mat3ToFlexcomm18        = 7U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct6Mat3ToFlexcomm18        = 8U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct7Mat3ToFlexcomm18        = 9U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1BMatchToFlexcomm18 = 12U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm18        = 13U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm18        = 14U + (FLEXCOMM18_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM19 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm19         = 0U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm19         = 1U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm19         = 2U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm19         = 3U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct5Mat3ToFlexcomm19        = 7U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct6Mat3ToFlexcomm19        = 8U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct7Mat3ToFlexcomm19        = 9U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1BMatchToFlexcomm19 = 12U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm19        = 13U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm19        = 14U + (FLEXCOMM19_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM20 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm20         = 0U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm20         = 1U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm20         = 2U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm20         = 3U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct5Mat3ToFlexcomm20        = 7U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct6Mat3ToFlexcomm20        = 8U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct7Mat3ToFlexcomm20        = 9U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1BMatchToFlexcomm20 = 12U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm20        = 13U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm20        = 14U + (FLEXCOMM20_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* ADC0 TRIG input mux */
    kINPUTMUX_Gpio0Irq0ToAdc0      = 0U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1Irq0ToAdc0      = 1U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2Irq0ToAdc0      = 2U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3Irq0ToAdc0      = 3U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4Irq0ToAdc0      = 4U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5Irq0ToAdc0      = 5U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6Irq0ToAdc0      = 6U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7Irq0ToAdc0      = 7U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8Irq0ToAdc0      = 8U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9Irq0ToAdc0      = 9U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10Irq0ToAdc0     = 10U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out4ToAdc0       = 11U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out5ToAdc0       = 12U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToAdc0       = 13U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToAdc0        = 14U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToAdc0        = 15U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToAdc0        = 16U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToAdc0        = 17U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToAdc0        = 18U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct5Mat3ToAdc0        = 19U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct6Mat3ToAdc0        = 20U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct7Mat3ToAdc0        = 21U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToAdc0        = 22U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cpu0TxevToAdc0       = 23U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cpu1TxevToAdc0       = 24U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_EzhvOutToAdc0        = 25U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BmatchToAdc0 = 26U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1BmatchToAdc0 = 27U + (ADC0_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier5 capture input mux. */
    kINPUTMUX_CtInp0ToTimer5CaptureChannels     = 0U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer5CaptureChannels     = 1U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer5CaptureChannels     = 2U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer5CaptureChannels     = 3U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer5CaptureChannels     = 4U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer5CaptureChannels     = 5U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer5CaptureChannels     = 6U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer5CaptureChannels     = 7U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer5CaptureChannels     = 8U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer5CaptureChannels     = 9U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer5CaptureChannels = 16U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer5CaptureChannels = 17U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer5CaptureChannels    = 18U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer5CaptureChannels = 19U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer5CaptureChannels = 20U + (CT32BIT5_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier6 capture input mux. */
    kINPUTMUX_CtInp0ToTimer6CaptureChannels     = 0U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer6CaptureChannels     = 1U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer6CaptureChannels     = 2U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer6CaptureChannels     = 3U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer6CaptureChannels     = 4U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer6CaptureChannels     = 5U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer6CaptureChannels     = 6U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer6CaptureChannels     = 7U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer6CaptureChannels     = 8U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer6CaptureChannels     = 9U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer6CaptureChannels = 16U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer6CaptureChannels = 17U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer6CaptureChannels    = 18U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer6CaptureChannels = 19U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer6CaptureChannels = 20U + (CT32BIT6_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier7 capture input mux. */
    kINPUTMUX_CtInp0ToTimer7CaptureChannels     = 0U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer7CaptureChannels     = 1U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer7CaptureChannels     = 2U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer7CaptureChannels     = 3U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer7CaptureChannels     = 4U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer7CaptureChannels     = 5U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer7CaptureChannels     = 6U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer7CaptureChannels     = 7U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer7CaptureChannels     = 8U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer7CaptureChannels     = 9U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer7CaptureChannels = 16U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer7CaptureChannels = 17U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer7CaptureChannels    = 18U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer7CaptureChannels = 19U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer7CaptureChannels = 20U + (CT32BIT7_CAP_PMUX_ID << PMUX_SHIFT),

