nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_inputmux_connections.h
    /*!< CTmier5 input trigger. */
    kINPUTMUX_CtInp0ToTimer5Trigger     = 0U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer5Trigger     = 1U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer5Trigger     = 2U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer5Trigger     = 3U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer5Trigger     = 4U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer5Trigger     = 5U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer5Trigger     = 6U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer5Trigger     = 7U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer5Trigger     = 8U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer5Trigger     = 9U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer5Trigger = 16U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer5Trigger = 17U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer5Trigger    = 18U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer5Trigger = 19U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer5Trigger = 20U + (CT32BIT5_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier6 input trigger. */
    kINPUTMUX_CtInp0ToTimer6Trigger     = 0U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer6Trigger     = 1U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer6Trigger     = 2U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer6Trigger     = 3U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer6Trigger     = 4U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer6Trigger     = 5U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer6Trigger     = 6U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer6Trigger     = 7U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer6Trigger     = 8U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer6Trigger     = 9U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer6Trigger = 16U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer6Trigger = 17U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer6Trigger    = 18U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer6Trigger = 19U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer6Trigger = 20U + (CT32BIT6_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier7 input trigger. */
    kINPUTMUX_CtInp0ToTimer7Trigger     = 0U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer7Trigger     = 1U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer7Trigger     = 2U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer7Trigger     = 3U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer7Trigger     = 4U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer7Trigger     = 5U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer7Trigger     = 6U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer7Trigger     = 7U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer7Trigger     = 8U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer7Trigger     = 9U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3TxSyncToTimer7Trigger = 16U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai3RxSyncToTimer7Trigger = 17U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer7Trigger    = 18U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer7Trigger = 19U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer7Trigger = 20U + (CT32BIT7_TRIG_PMUX_ID << PMUX_SHIFT),
#endif

} inputmux_connection_t;

/*@}*/

#endif /* _FSL_INPUTMUX_CONNECTIONS_ */
